# WorksharingDisplayGraphicSettings Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksharingDisplayGraphicSettings Members
WorksharingDisplayGraphicSettings Class Constructors Methods Properties See Also
---
The WorksharingDisplayGraphicSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| WorksharingDisplayGraphicSettings | Creates a new instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the WorksharingDisplayGraphicSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FillColor | The fill color that will be applied to elements when these settings are applied. Note that this is automatically set by increasing the luma of the specified line color by 65%. |
| IsApplied | Indicates whether this set of graphic overrides will be applied. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LineColor | The line color that will be applied to elements when these settings are applied. |

# See Also
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace